cmsis-svd/cmsis-svd/data/Atmel/ATSAME51J19A.svd
            <register>
               <dim>2</dim>
               <dimIncrement>2</dimIncrement>
               <name>DACCTRL[%s]</name>
               <description>DAC n Control</description>
               <addressOffset>0xC</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>LEFTADJ</name>
                     <description>Left Adjusted Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable DAC0</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCTRL</name>
                     <description>Current Control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CCTRLSelect</name>
                        <enumeratedValue>
                           <name>CC100K</name>
                           <description>100kSPS</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CC1M</name>
                           <description>500kSPS</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CC12M</name>
                           <description>1MSPS</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FEXT</name>
                     <description>Standalone Filter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DITHER</name>
                     <description>Dithering Mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REFRESH</name>
                     <description>Refresh period</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>REFRESHSelect</name>
                        <enumeratedValue>
                           <name>REFRESH_0</name>
                           <description>Do not Refresh</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFRESH_1</name>
                           <description>Refresh every 30 us</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFRESH_2</name>
                           <description>Refresh every 60 us</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFRESH_3</name>
                           <description>Refresh every 90 us</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFRESH_4</name>
                           <description>Refresh every 120 us</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFRESH_5</name>
                           <description>Refresh every 150 us</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFRESH_6</name>
                           <description>Refresh every 180 us</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFRESH_7</name>
                           <description>Refresh every 210 us</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFRESH_8</name>
                           <description>Refresh every 240 us</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFRESH_9</name>
                           <description>Refresh every 270 us</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFRESH_10</name>
                           <description>Refresh every 300 us</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFRESH_11</name>
                           <description>Refresh every 330 us</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFRESH_12</name>
                           <description>Refresh every 360 us</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFRESH_13</name>
                           <description>Refresh every 390 us</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFRESH_14</name>
                           <description>Refresh every 420 us</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFRESH_15</name>
                           <description>Refresh every 450 us</description>
                           <value>15</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OSR</name>
                     <description>Sampling Rate</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>OSRSelect</name>
                        <enumeratedValue>
                           <name>OSR_1</name>
                           <description>No Over Sampling</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR_2</name>
                           <description>2x Over Sampling Ratio</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR_4</name>
                           <description>4x Over Sampling Ratio</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR_8</name>
                           <description>8x Over Sampling Ratio</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR_16</name>
                           <description>16x Over Sampling Ratio</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR_32</name>
                           <description>32x Over Sampling Ratio</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>2</dimIncrement>
               <name>DATA[%s]</name>
               <description>DAC n Data</description>
               <addressOffset>0x10</addressOffset>
               <size>16</size>
               <access>write-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DAC0 Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>2</dimIncrement>
               <name>DATABUF[%s]</name>
               <description>DAC n Data Buffer</description>
               <addressOffset>0x14</addressOffset>
               <size>16</size>
               <access>write-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>DATABUF</name>
                     <description>DAC0 Data Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control</description>
               <addressOffset>0x18</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DBGRUN</name>
                     <description>Debug Run</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>2</dimIncrement>
               <name>RESULT[%s]</name>
               <description>Filter Result</description>
               <addressOffset>0x1C</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>RESULT</name>
                     <description>Filter Result</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
