cmsis-svd/cmsis-svd/data/Atmel/ATSAME51J19A.svd
               <register>
                  <name>TAMPCTRL</name>
                  <description>Tamper Control</description>
                  <addressOffset>0x60</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>IN0ACT</name>
                        <description>Tamper Input 0 Action</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>IN0ACTSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>Off (Disabled)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>WAKE</name>
                              <description>Wake without timestamp</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTURE</name>
                              <description>Capture timestamp</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ACTL</name>
                              <description>Compare IN0 to OUT</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IN1ACT</name>
                        <description>Tamper Input 1 Action</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>IN1ACTSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>Off (Disabled)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>WAKE</name>
                              <description>Wake without timestamp</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTURE</name>
                              <description>Capture timestamp</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ACTL</name>
                              <description>Compare IN1 to OUT</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IN2ACT</name>
                        <description>Tamper Input 2 Action</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>IN2ACTSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>Off (Disabled)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>WAKE</name>
                              <description>Wake without timestamp</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTURE</name>
                              <description>Capture timestamp</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ACTL</name>
                              <description>Compare IN2 to OUT</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IN3ACT</name>
                        <description>Tamper Input 3 Action</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>IN3ACTSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>Off (Disabled)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>WAKE</name>
                              <description>Wake without timestamp</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTURE</name>
                              <description>Capture timestamp</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ACTL</name>
                              <description>Compare IN3 to OUT</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IN4ACT</name>
                        <description>Tamper Input 4 Action</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>IN4ACTSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>Off (Disabled)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>WAKE</name>
                              <description>Wake without timestamp</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTURE</name>
                              <description>Capture timestamp</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ACTL</name>
                              <description>Compare IN4 to OUT</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TAMLVL0</name>
                        <description>Tamper Level Select 0</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMLVL1</name>
                        <description>Tamper Level Select 1</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMLVL2</name>
                        <description>Tamper Level Select 2</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMLVL3</name>
                        <description>Tamper Level Select 3</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMLVL4</name>
                        <description>Tamper Level Select 4</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DEBNC0</name>
                        <description>Debouncer Enable 0</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DEBNC1</name>
                        <description>Debouncer Enable 1</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DEBNC2</name>
                        <description>Debouncer Enable 2</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DEBNC3</name>
                        <description>Debouncer Enable 3</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DEBNC4</name>
                        <description>Debouncer Enable 4</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TIMESTAMP</name>
                  <description>MODE0 Timestamp</description>
                  <addressOffset>0x64</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>COUNT</name>
                        <description>Count Timestamp Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TAMPID</name>
                  <description>Tamper ID</description>
                  <addressOffset>0x68</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>TAMPID0</name>
                        <description>Tamper Input 0 Detected</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMPID1</name>
                        <description>Tamper Input 1 Detected</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMPID2</name>
                        <description>Tamper Input 2 Detected</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMPID3</name>
                        <description>Tamper Input 3 Detected</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMPID4</name>
                        <description>Tamper Input 4 Detected</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TAMPEVT</name>
                        <description>Tamper Event Detected</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>8</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>BKUP[%s]</name>
                  <description>Backup</description>
                  <addressOffset>0x80</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>BKUP</name>
                        <description>Backup</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <name>MODE1</name>
               <description>16-bit Counter with Two 16-bit Compares</description>
               <alternateCluster>MODE0</alternateCluster>
               <headerStructName>RtcMode1</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>MODE1 Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>COUNT32</name>
                              <description>Mode 0: 32-bit Counter</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>COUNT16</name>
                              <description>Mode 1: 16-bit Counter</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLOCK</name>
                              <description>Mode 2: Clock/Calendar</description>
                              <value>2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PRESCALER</name>
                        <description>Prescaler</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>PRESCALERSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/1</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV1</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/1</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV2</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/2</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV4</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/4</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV8</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/8</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV16</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/16</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV32</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/32</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV64</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/64</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV128</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/128</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV256</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/256</description>
                              <value>0x9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV512</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/512</description>
                              <value>0xA</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV1024</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/1024</description>
                              <value>0xB</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BKTRST</name>
                        <description>BKUP Registers Reset On Tamper Enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>GPTRST</name>
                        <description>GP Registers Reset On Tamper Enable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>COUNTSYNC</name>
                        <description>Count Read Synchronization Enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
